read_verilog test.v
# expose some registers => the logic outputting them will be modeled
cd Test
expose a
expose b
expose c
cd ..
prep -top Counter
memory
proc
prep -flatten -top Counter
write_smt2  -stbv -wires counter.smt2

#write_smt2  -wires test-aufbv.smt2
