read_verilog readmem_test.v
# expose some registers => the logic outputting them will be modeled
cd Test
expose a
expose b
expose c
cd ..

#conservative RTL synthesis
prep
# convert to multiplexers and registers
proc
# transformations
hierarchy -check
#Analyze memories and create circuits to implement them
memory
# flatten the design before conservative RTL synthesis 
prep -flatten
write_smt2  -stbv -wires readmem_test.smt2

#write_smt2  -wires test-aufbv.smt2
