read_verilog test-noinit.v
# expose some registers => the logic outputting them will be modeled
cd Test
expose a
expose b
expose c
cd ..
prep  
memory
proc
prep -flatten
#write_smt2  -stbv -wires test-noinit.smt2

write_smt2  -wires test-noinit.smt2
