read_verilog test.v
# expose some registers => the logic outputting them will be modeled
cd Test
expose a
expose b
expose c
cd ..
prep  
memory
proc
prep -flatten
#write_smt2  -stbv -wires test.smt2

write_smt2  -wires test-aufbv.smt2
